[{"title": "Need help on finding a new career post stroke?", "selftext": "I'm not sure how to go about finding a new career and working after i Suffered a stroke 1.5 years ago"}, {"title": "I really need help!! Is there a way around a Non-compete Agreement?", "selftext": " \n\nHeya reddit, I really need help,\n\nI have come across a great opportunity, right now I work for a residential solar company in central Pennsylvania making 20 per hour.\n\nI could do commercial solar for another company making 27 or 35 per hour, and its a union.\n\nEasy decision right just do it, only one problem, the contract I signed has a NON-COMPETE AGREEMENT, and I have heard through the grapevine that the owner likes to sue people.\n\nIs there a usual way around these things.\n\ndoes it matter that I'm going from residential to commercial\n\nwhat can I do, I really want this job, I need to capitalize on this opportunity, please someone help me with great advice"}, {"title": "has anyone ever feel resistant to talk with someone when we need help?", "selftext": "\n\nIdk if it's because of shyness or insecurities or fear of judgement like I feel as if I'm so behind in life. I heard that networking and communication like reaching out to others is so important to get ahead in life whether it's learning a skill, or getting a job or just advice in general. \n\nWith the lack of guideline or motivation life has become so confusing honestly. I feel like I don't know what the heck I'm doing at 26. I don't know my career path even I'm in community college. I don't have a job. Don't even know where else to apply besides  fast food or retail. All my childhood friends are getting married and settling down In life. While I'm getting lectured and judged by everyone's accomplishments. I feel so down and confused like I'm seriously feeling as if I'm just crying and tearing up from inside. Having no determination or vision, life has become so blurry. I don't know what to do. I'm just worrying and stressing myself out. I'm just lacking in every aspect of my life."}, {"title": "Need help regarding my career or my usual career practice ?", "selftext": "Need advice from Reddit\n\nHi is it normal? \n\nWhen entering a new job \n1. First 6months - I will be  do everything warrior and do everything in the company regardless my duty or not and learn other ppl duties (I’m a manager) \n2. Next 6months - I will delegate the jobs, while enhancing or simplify the procedure for easier execution \n3. Following one year - I will manage and automate the jobs and troubleshoot when required. Usually during this phase jobs that took me 4 hours to do previously can be execute in less than half an hour. \n4. 3rd year onwards I start looking for job as I am bored. \n\nIs this normal? I keep getting bored of jobs."}, {"title": "Need help career switch to CS ?", "selftext": "Need help !! Please\n\nHello Everyone, Thank for helping me. \nI want to switch my career to CS, for better pay and perks. I did master in Electrical Engineering and working as system engineer in product base firm. My growth is poor over 4 year. I don’t know where to start which field should I pick. I know C programming and I recently completed CS50 course. I did some research and find put Full stack, Data, AI, Cybersecurity is booming nowadays. \nFoks from your experience, can you tell which field is right for me(i.e; non-cs person can do it as well get a job) as well as any resources I can look out. My goal is enter in tech and get a job by the end of this year. If someone have similar journeys please comment down, it will help me. \nThank you for help 😊"}, {"title": "I want to leave the advertising industry, but need help doing so. Can anyone help?", "selftext": "Posting from my throwaway account.\n\nLate 20's-Early 30's, no kids. I work for a major media publisher in the advertising space and I want to move onto another job/role away from advertising. Currently, I'm a Media Planner and I'm just tired of the day in and day out responsibilities of the job. The pay isn't great and the amount of work/responsibility I have to deal with is ridiculous and not worth it. After working the job for a few years, I'm not even into media/tv and hardly even watch it. I wish I went into a different degree besides Marketing.\n\nI want to transition into the tech, video games and or finance space, as I want to increase my earning potential as well as change my environment (move to a better place, get braces, etc). The only thing is that this was my first job out of college and every time I apply for a position and or role away from advertising, I usually get a rejection stating I don't have enough experience which is very frustrating. Its demotivating at times trying to leave and not being able to get at least a chance at an interview.\n\nAlso, I would like to earn at least decent money since I have a car note, rent and cc debt.\n\nWhat's the recommendations on leaving the advertising industry?"}, {"title": "I am lost, I need help?", "selftext": "Hi All,\n\nI am very lost and terrified. I am 25, living with parents, I’m hoping to move out this year after getting married. \n\nMaybe I’m the only one, but I constantly worry about finances and trying to raise a family one day. \n\nWhat I Do: I am a freelance web designer and also a mover so I help people with moving services. My only concern: I feel like I’m not busy enough, I find days where I’m just sitting in front of the computer playing on my phone. I want to be successful, and make a living. I just don’t know what direction to take. \n\nTLTR- I dropped out of college at 21 with 2 quarters away from my EE degree due to covid. (I have about 15k in cash, where do I go from here)"}, {"title": "I am so lost and need help ?", "selftext": "    Hello everyone , I have a degree in law and business and I f*ucking hate law . I am very grateful that my parents are supportive and have been open minded and accepting towards my decisions but I hate law and they are advising me to study business abroad . again I am so beyond grateful for their support but I am so confused and if that’s the route I should go down because I have already spent five years getting a very expensive law and business degree and I don’t want to waste their money anymore .\n    I don’t mind hard work at all and I really want to make an above decent earning possibly in Canada or somewhere in UK , at least 100k+ But I am split between a masters in psychology or business\n    I feel like I have an inclination towards both and would do well in both I just want to know which of those two will get me more money . It sounds very money driven and maybe it is but honestly after contemplation it came down to the money factor because I truly do enjoy both the subjects \n    Please give your suggestions here I would be very very thankful"}, {"title": "Need help leaving a toxic workplace?", "selftext": "I’ve been at this job for 4 months. I love the work but the environment is toxic, unorganized, and more. I like my co-workers but everyone is so stressed and even angry that I just don’t think I can stay much longer. The issues stem at the C-suite level so I don’t have any hope for change. My problem is that this is the first job I’ve ever had in this field and I’d like to continue.   Ideally I’d like to find something at the 6 month mark. Should I put this job on my resume? How do I explain my swift departure? I don’t want to lose the opportunity to say that I did all this work at this particular place (a popular news station).    Thanks in advance."}, {"title": "does anyone know of any well paying jobs and course to take in college for them for someone who isn’t very book smart? (this is a rather long post but i really need help)", "selftext": "i’m 18 and i’m about to graduate high school. my entire life i’ve loved singing and performing, and more recently i’ve also grown to live acting, musical theatre, all of that stuff. i figured i would go to college for music performance specifically for voice. however they only offer classical music opera and jazz and i have no knowledge and don’t wish to have an knowledge in those types of music. and auditions require knowing english art songs from the 16-18th century which i can’t even find in the internet. and other songs from the same time in german and other languages. it’s too much. and on top of that they require classes based on music i tried taking in high school but could not understand. i was looking into majoring in musical theatre however i know that process at the school i want to go to is very competitive. i don’t know if this is true but i was told that musical theatre students need to get a role in every show in order to get their degree. and i’m dumb but not to dumb to realize there are so many people who are more skilled than i am. if it’s true that they need to make it into every show i am done for. i’m good but not THAT good. not even at high school level. i didn’t make it into the show this year because they were holding a personal grudge after i left school last year after making it in. but it shows i wasn’t talented enough that they were willing to forgive me for needing to leave school last year. anyways back to the point, i started looking around for courses that will open up more stable job opportunities that pay well even if they won’t make me happy. but i quickly realized i’m terrible at almost everything. math is out of the question, even algebra wants to make me rip my hair out. science is out too, biology was a freshman year class and the only reason i passed is bc covid started that year. chemistry the next year was a disaster i had to take a summer course and cried about it all the time. the issue is well paying jobs require good math and science skills. even being a music teacher which i considered requires taking the classes regarding music that i don’t understand. i feel like in all subjects i am drowning while desperately just trying to stay afloat. i ran out of time to decide what i want to do. i need to make enough money to live and support myself and possibly a child when i’m older but i’m so genuinely stupid i can’t even think of any job i could take a class for. my whole life i’ve been told there’s time but now i’m out of time. i am desperate. the only thing i can think of is being a secretary which is ok with me but secretaries don’t get paid much do they? i want to be able to support myself and do it well. the scariest thing for me is failing and ending up back with my parents having my mom tell me she was right about how i shouldn’t have gone to college this year because it was a waste of money. that too i need to make sure i stuck with what i choose because my family is nor rich we are not poor either however college is obviously an insane amount of money and i will never hear the end of it. if i mess up. and i may not have their support for school after. i don’t want to be that 30 year old living with their parents. please help me."}]